MONITOR_OBJECT_TYPE = {
    "OS": "操作系统",
    "Web": "网络",
    "K8S": "K8S",
    "Network Device": "网络设备",
    "Hardware Device": "硬件设备",
    "Other": "其他数据源备",
}

MONITOR_OBJECT = {
    "Host": "主机",
    "Website": "网站",
    "Ping": "Ping",
    "Cluster": "K8S集群",
    "Pod": "Pod",
    "Node": "Node",
    "Switch": "交换机",
    "Router": "路由器",
    "Loadbalance": "负载均衡",
    "Firewall": "防火墙",
    "Detection Device": "检测设备",
    "Bastion Host": "堡垒机",
    "Scanning Device": "扫描设备",
    "Storage": "存储设备",
    "Hardware Server": "硬件服务器",
    "SNMP Trap": "SNMP Trap"
}

MONITOR_OBJECT_PLUGIN = {
    "Host": {
        "name": "主机",
        "desc": "主机监控插件用于收集和分析主机的性能数据，包括CPU、内存、磁盘和网络使用情况"
    },
    "Website": {
        "name": "网站拨测",
        "desc": "网站拨测插件的作用是可以定期检查HTTP/HTTPS连接的可用性和性能"
    },
    "Ping": {
        "name": "Ping",
        "desc": "ping用于通过发送ICMP Echo请求（ping）来检查目标主机或网络设备的连通性和响应时间。"
    },
    "K8S": {
        "name": "K8S",
        "desc": "K8S监控插件用于监控Kubernetes集群的状态和健康，包括节点、容器和pod的性能指标"
    },
    "Switch SNMP General": {
        "name": "交换机通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理交换机的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Router SNMP General": {
        "name": "路由器通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理路由器的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Loadbalance SNMP General": {
        "name": "负载均衡通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理负载均衡的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Firewall SNMP General": {
        "name": "防火墙通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理防火墙的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Detection Device SNMP General": {
        "name": "检测设备通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理检测设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Bastion Host SNMP General": {
        "name": "堡垒机通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理堡垒机的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Scanning Device SNMP General": {
        "name": "扫描设备通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理扫描设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Storage SNMP General": {
        "name": "存储设备通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理扫描设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Storage IPMI": {
        "name": "存储设备通用（IPMI）",
        "desc": "IPMI监控插件与硬件通信，提供对系统健康状态、硬件传感器数据和电源管理的实时监控。"
    },
    "Hardware Server SNMP General": {
        "name": "硬件服务器通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理扫描设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Hardware Server IPMI": {
        "name": "硬件服务器通用（IPMI）",
        "desc": "IPMI监控插件与硬件通信，提供对系统健康状态、硬件传感器数据和电源管理的实时监控。"
    },
    "SNMP Trap": {
        "name": "SNMP Trap",
        "desc": "SNMP Trap监控插件用于接收和处理网络设备主动推送的报警或状态通知（Trap消息），以实现实时监控和故障告警。"
    },
}

MONITOR_OBJECT_METRIC_GROUP = {
    "Host": {
        "CPU": "CPU",
        "System": "系统",
        "Disk IO": "磁盘 IO",
        "DISK": "磁盘",
        "Process": "进程",
        "MEMORY": "内存",
        "Net": "网络",
    },
    "Website": {
        "HTTP": "HTTP",
    },
    "Ping": {
        "Ping": "Ping",
    },
    "Cluster": {
        "Counts": "数量",
        "Utilization": "使用率",
    },
    "Pod": {
        "Status": "状态",
        "CPU": "CPU",
        "Memory": "内存",
        "Disk": "磁盘",
        "Network": "网络",
    },
    "Node": {
        "Status": "状态",
        "CPU": "CPU",
        "Memory": "内存",
        "Disk": "磁盘",
        "Net": "网络",
        "Load": "负载",
    },
    "Switch": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Router": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Loadbalance": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Firewall": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Detection Device": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Bastion Host": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Scanning Device": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
    },
    "Storage": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
        "Power": "功率",
        "Environment": "环境",
    },
    "Hardware Server": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "数据包错误",
        "Packet Loss": "数据包丢失",
        "Packet": "数据包",
        "Traffic": "流量",
        "Power": "功率",
        "Environment": "环境",
    },
    "SNMP Trap": {
    }
}



MONITOR_OBJECT_METRIC = {
    "Host": {
    "cpu_summary.usage": {
        "name": "CPU 使用率",
        "desc": "显示CPU的使用率，来表示系统的负载情况。它通过总量减去空闲量得出。此指标对监控系统性能非常关键。"
    },
    "cpu_summary.idle": {
        "name": "CPU 空闲率",
        "desc": "显示CPU的空闲率，表示系统中未被使用的CPU资源量。这有助于了解系统是否处于高负载。此指标对分析系统性能和效率至关重要。"
    },
    "cpu_summary.iowait": {
        "name": "等待 IO 的时间占比",
        "desc": "显示CPU等待IO操作完成的时间占比，这指示出磁盘或网络性能对系统的影响程度。减少等待时间有助于提升系统性能。此指标对分析系统瓶颈点非常有用。"
    },
    "cpu_summary.system": {
        "name": "系统占用率",
        "desc": "显示系统占用率，表示内核进程消耗的CPU资源，分析该值有助于优化系统内核的性能和稳定性。"
    },
    "cpu_summary.user": {
        "name": "用户占用率",
        "desc": "显示用户进程占用的CPU资源比例，这帮助了解应用程序和服务的性能。本指标对于了解具体应用的CPU消耗有帮助。"
    },
    "load1": {
        "name": "1 分钟平均负载",
        "desc": "显示系统在最近一分钟内的平均负载，提供短期内系统活动的快照。本指标有助于实时监控系统性能。"
    },
    "load5": {
        "name": "5 分钟平均负载",
        "desc": "显示系统在最近五分钟内的平均负载，反映中期系统的负载情况。此中期指标有助于发现持续和间歇性的高负载情况。"
    },
    "load15": {
        "name": "15 分钟平均负载",
        "desc": "显示系统在最近十五分钟内的平均负载，长时间的负载观察有助于了解系统的整体性能趋势。"
    },
    "diskio_writes": {
        "name": "磁盘写入速率",
        "desc": "统计在指定时间间隔内，系统写入数据到磁盘的操作次数。"
    },
    "diskio_write_bytes": {
        "name": "磁盘写入大小",
        "desc": "统计在指定时间间隔内，系统写入数据到磁盘的字节数，并用兆字节 (MB) 表示。"
    },
    "diskio_write_time": {
        "name": "磁盘写入耗时",
        "desc": "统计在指定时间间隔内，系统写入数据到磁盘所用的时间，以秒 (s) 为单位。"
    },
    "diskio_reads": {
        "name": "磁盘读出速率",
        "desc": "统计在指定时间间隔内，系统从磁盘读取数据的操作次数。"
    },
    "diskio_read_bytes": {
        "name": "磁盘读出大小",
        "desc": "统计在指定时间间隔内，系统从磁盘读取的字节数，并用兆字节 (MB) 表示。"
    },
    "diskio_read_time": {
        "name": "磁盘读出耗时",
        "desc": "统计在指定时间间隔内，系统从磁盘读取数据所用的时间，以秒 (s) 为单位。"
    },
    "disk.is_use": {
        "name": "磁盘使用率",
        "desc": "显示磁盘空间的使用比例，帮助了解磁盘资源的使用情况。该指标对防止磁盘满溢非常重要。"
    },
    "disk.used": {
        "name": "磁盘已用空间大小",
        "desc": "显示实际使用的磁盘空间（以GB为单位），用于确定磁盘容量使用情况。本指标对监控磁盘空间的使用量很有帮助。"
    },
    "env.procs": {
        "name": "总进程数",
        "desc": "显示系统中运行的总进程数，帮助了解系统负载分布情况。此指标对监控系统的整体运行情况非常重要。"
    },
    "env.proc_running_current": {
        "name": "正在运行进程数",
        "desc": "显示当前正在运行的进程数，用于评估系统的并发运行情况。此指标对实时监控系统负载有重要价值。"
    },
    "env.procs_blocked_current": {
        "name": "正在等待 IO 的进程数",
        "desc": "显示正在等待IO操作的进程数，分析此值有助于优化系统性能并减少瓶颈。此指标对发现IO瓶颈很有帮助。"
    },
    "mem.total": {
        "name": "物理内存总大小",
        "desc": "显示系统的总物理内存量（单位为GB），概述系统资源配置。此指标对了解系统资源的基础配置很重要。"
    },
    "mem.free": {
        "name": "物理内存空闲量",
        "desc": "显示当前空闲的物理内存量（单位为GB），帮助了解可用资源。此指标是掌握内存资源使用情况的关键。"
    },
    "mem.cached": {
        "name": "Cache 缓存的空间大小",
        "desc": "显示用于缓存的内存量（单位为GB），用于提高系统性能。该指标对理解内存缓存策略非常重要。"
    },
    "mem.buffer": {
        "name": "Buffer 的空间大小",
        "desc": "显示用于缓冲的内存量（单位为GB），保障数据的稳定传输。此指标对于性能优化策略非常重要。"
    },
    "mem.usable": {
        "name": "应用程序内存可用量",
        "desc": "显示应用程序可用的内存（单位为GB），确保应用的平稳运行。此指标对维持应用性能和稳定性很重要。"
    },
    "mem.pct_usable": {
        "name": "应用程序内存可用率",
        "desc": "显示内存可用率，帮助确定内存是否充足以支持应用程序。该指标对监控内存压力和扩容策略有用。"
    },
    "mem.used": {
        "name": "应用程序内存使用量",
        "desc": "显示应用程序使用的内存量（单位为GB），分析此值有助于优化应用内存使用。此指标对监控应用资源消耗非常关键。"
    },
    "mem.pct_used": {
        "name": "应用程序内存使用占比",
        "desc": "显示应用程序内存使用占比，了解内存使用分布情况。此指标对优化内存使用有重要参考价值。"
    },
    "mem.psc_used": {
        "name": "物理内存已用量",
        "desc": "显示系统已用的物理内存总量（单位为GB），帮助整体掌握内存资源分配。此指标对全面了解系统内存使用情况非常重要。"
    },
    "mem.shared": {
        "name": "共享内存使用量",
        "desc": "显示共享内存的使用量（单位为GB），用于进程间的数据共享。此指标对优化系统内存分配策略有帮助。"
    },
    "net.speed_packets_recv": {
        "name": "网卡入包量",
        "desc": "显示单位时间内网络接口接收的数据包数量，用于评估网络接收性能。本指标对监控网络流量非常关键。"
    },
    "net.speed_packets_sent": {
        "name": "网卡出包量",
        "desc": "显示单位时间内网络接口发送的数据包数量，用于评估网络发送性能。本指标对监控网络流量非常关键。"
    },
    "net.speed_recv": {
        "name": "网卡入流量",
        "desc": "显示单位时间内网络接口接收的字节数量（单位为MB），用于评估网络带宽利用率。本指标对监控网络带宽非常重要。"
    },
    "net.speed_sent": {
        "name": "网卡出流量",
        "desc": "显示单位时间内网络接口发送的字节数量（单位为MB），用于评估网络带宽利用率。本指标对监控网络带宽非常关键。"
    },
    "net.errors_in": {
        "name": "网卡错误包",
        "desc": "显示网络接口接收到的错误包数量，用于检测网络问题。此指标对发现网络故障和不正常流量非常有帮助。"
    },
    "net.errors_out": {
        "name": "网卡错误包",
        "desc": "显示网络接口发送的错误包数量，帮助了解网络传输错误。此指标对发现网络故障和不正常流量非常有帮助。"
    },
    "net.dropped_in": {
        "name": "网卡丢弃包",
        "desc": "显示网络接口接收到的丢弃包数量，指示网络接收拥塞情况。本指标对监控网络可靠性非常关键。"
    },
    "net.dropped_out": {
        "name": "网卡丢弃包",
        "desc": "显示网络接口发送的丢弃包数量，指示网络发送拥塞情况。本指标对监控网络可靠性非常关键。"
    }
},
    "Website": {
    "http_success.rate": {
        "name": "拨测成功率",
        "desc": "衡量多个节点在拨测目标时成功响应的比例（成功次数占总请求次数的百分比）。"
    },
    "http_duration": {
        "name": "HTTP响应时间",
        "desc": "该指标表示从发起HTTP请求到接收到HTTP响应的总时间。用于评估Web服务的性能，尤其是在处理用户请求时。较长的持续时间可能表示后端处理效率低或网络延迟，影响用户体验。对提高系统响应性和优化性能至关重要。"
    },
    "http_code": {
        "name": "HTTP 响应状态码",
        "desc": "该指标用于表示HTTP请求的响应状态码。它记录了HTTP响应状态码的值，例如200（成功）、404（未找到）、500（服务器错误）等。这些状态码对于监控Web应用程序的健康状况和性能非常重要，可以帮助识别潜在问题。"
    },
    "http_content.length": {
        "name": "HTTP内容长度",
        "desc": "该指标表示HTTP响应的内容长度，单位为字节。较大的内容长度可能导致数据传输时间过长，并消耗更多带宽。在优化网站性能或分析带宽使用时，监测此指标至关重要。了解响应内容大小可以帮助开发者进行优化。"
    }
},
    "Ping":{
    "ping_ttl": {
        "name": "平均TTL",
        "desc": "表示 ping 数据包从源设备到目标设备允许的平均跳数（或时间）。此指标有助于发现数据包是否经过了异常多的跳数或是否存在路径异常。TTL 值较高时网络路径较长。"
    },
    "ping_response_time": {
        "name": "平均响应时间",
        "desc": "表示一段时间内，目标设备的 ping 响应时间的均值。该指标帮助衡量目标设备与源设备的延迟表现。较低的平均响应时间表示网络性能较好。"
    },
    "ping_packet_transmission_rate": {
        "name": "数据包传输成功率",
        "desc": "表示成功接收的数据包数占发送数据包总数的百分比。此指标用于衡量网络质量和数据传输的可靠性。丢包率低表示网络连接稳定且可靠。"
    },
    "ping_packet_loss_rate": {
        "name": "数据包丢失率",
        "desc": "表示在 ping 请求中丢失数据包所占的百分比。此指标帮助确定不稳定的网络连接或传输问题。较低的丢失率表示网络连接更稳定。"
    },
    "ping_error_response_code": {
        "name": "Ping状态",
        "desc": "表示 ping 操作执行后的结果代码。结果代码为 0 表示操作成功，非零值表示网络或主机可能存在问题。该指标用于快速检测网络连接故障。"
    }
},
    "Cluster": {
        "cluster_pod_count": {
            "name": "Pod Count",
            "desc": "用于统计当前 Kubernetes 集群中 Pods 的总数。该指标会返回集群中运行的 Pod 的数量，包括所有命名空间中的 Pod。"
        },
        "cluster_node_count": {
            "name": "Node Count",
            "desc": "用于统计当前 Kubernetes 集群中节点的总数。该指标返回集群中可用节点的数量，帮助用户了解集群的规模和资源。"
        },
        "cluster_cpu_utilization": {
            "name": "CPU Utilization",
            "desc": "表示集群中 CPU 的当前利用率，通常以百分比形式表示。"
        },
        "cluster_memory_utilization": {
            "name": "Memory Utilization",
            "desc": "显示集群内存的当前利用率，以百分比形式展示。"
        }
    },
    "Pod": {
        "pod_status": {
            "name": "Pod状态",
            "desc": "获取 Pod 当前的状态信息，例如已运行、已停止等。"
        },
        "pod_restart_count": {
            "name": "重启次数",
            "desc": "监控 Pod 内各个容器的重启次数，以评估稳定性与问题频发程度。"
        },
        "pod_cpu_utilization": {
            "name": "CPU使用率",
            "desc": "计算 Pod CPU 使用率，即容器 CPU 限制与请求的差值，反映 CPU 资源的入住情况。"
        },
        "pod_memory_utilization": {
            "name": "内存使用率",
            "desc": "计算 Pod 的内存利用率，即内存限制与请求的比例。"
        },
        "pod_io_writes": {
            "name": "I/O写速率",
            "desc": "此指标表示特定Pod在指定时间段内的I/O写入操作次数。写入次数可以帮助分析应用程序对存储系统的写入需求。"
        },
        "pod_io_read": {
            "name": "I/O读速率",
            "desc": "此指标表示特定Pod在指定时间段内的I/O读取操作次数。读取次数可以帮助分析应用程序对存储系统的读取需求。"
        },
        "pod_network_in": {
            "name": "网络入流量",
            "desc": "监控 Pod 的网络流入流量，通过 Pod 的容器数量与 IP 数量计算而得。"
        },
        "pod_network_out": {
            "name": "网络出流量",
            "desc": "监控 Pod 的网络流出流量，通过 Pod 的容器数量与 IP 数量计算而得。"
        }
    },
    "Node":{
  "node_status_condition": {
    "name": "Node状态",
    "desc": "Node状态用于指示节点的当前运行状态，比如“运行中”或“已停止”。它有助于管理员监控和管理Kubernetes集群中的节点。"
  },
  "node_cpu_utilization": {
    "name": "CPU使用率",
    "desc": "CPU使用率表示当前节点CPU的实际使用水平，相对于其总可用CPU资源。监控此指标有助于识别CPU瓶颈和优化资源分配。"
  },
  "node_memory_usage": {
    "name": "应用内存使用量",
    "desc": "应用内存使用量表示在节点中运行的应用程序占用的内存总量。此指标有助于了解应用程序的内存需求及其对系统性能的影响。"
  },
  "node_memory_utilization": {
    "name": "应用内存使用率",
    "desc": "应用内存使用率是指应用程序已使用的内存量与其配置的内存限制之比。通过监控此指标，用户可以判断是否需要调整内存限制。"
  },
  "node_io_read": {
    "name": "磁盘写速率",
    "desc": "磁盘写速率表示节点在特定时间段内进行的写入操作的速率。此指标对于监控应用程序的磁盘写入性能至关重要。"
  },
  "node_io_write": {
    "name": "磁盘读速率",
    "desc": "磁盘读速率表示节点在特定时间段内进行的读取操作的速率。此指标有助于评估应用程序的数据读取性能和存储负载。"
  },
  "node_network_receive": {
    "name": "网卡入流量",
    "desc": "网卡入流量是指通过网络接口接收到的数据流量。监控此指标可帮助分析网络带宽是否足够以及网络性能情况。"
  },
  "node_network_transmit": {
    "name": "网卡出流量",
    "desc": "网卡出流量是指通过网络接口发送的数据流量。此指标有助于了解节点的网络出口需求和潜在的瓶颈。"
  },
  "node_cpu_load1": {
    "name": "1 分钟平均负载",
    "desc": "1 分钟平均负载表示过去1分钟内系统的平均负载情况。该指标有助于即时了解系统的负载水平。"
  },
  "node_cpu_load5": {
    "name": "5 分钟平均负载",
    "desc": "5 分钟平均负载表示过去5分钟内系统的平均负载情况。此指标有助于识别负载趋势及其对系统性能的影响。"
  },
  "node_cpu_load15": {
    "name": "15 分钟平均负载",
    "desc": "15 分钟平均负载表示过去15分钟内系统的平均负载情况。监控该指标可帮助管理员理解系统的长期负载状态。"
  }
    },
    "Switch": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Router": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Loadbalance": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Firewall": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Detection Device": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Bastion Host": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Scanning Device": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  }
    },
    "Storage": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  },
   "ipmi_chassis_power_state": {
        "name": "电源状态",
        "desc": "电源状态指标，用于监测设备是否处于开机状态。其值可以表示电源开启或关闭状态。主要用于远程管理和监控设备的电源情况。"
    },
    "ipmi_power_watts": {
        "name": "功率",
        "desc": "功率指标以瓦特 (watts) 为单位，反映设备当前功耗。通过此指标可以评估设备能效和功耗趋势。便于设置节能政策和资源优化。"
    },
    "ipmi_voltage_volts": {
        "name": "电压功率",
        "desc": "电压功率指标以伏特 (volts) 为单位，监测设备内部不同电源轨的电压情况。稳定的电压供应对于设备的可靠性至关重要。通过该指标可以快速识别电气问题，保障正常运行。"
    },
    "ipmi_fan_speed_rpm": {
        "name": "风扇转速",
        "desc": "风扇转速指标以每分钟转数 (rpm) 表示，监测设备内风扇的工作状态。高效的风扇运作是维护设备温度的关键。有助于防止过热，确保设备长时间稳定运行。"
    },
    "ipmi_temperature_celsius": {
        "name": "温度",
        "desc": "温度指标以摄氏度 (Celsius) 为单位，监控设备内部温度。通过监测温度可以预防热量累积，防止设备过热。对于维持系统的稳定性和寿命非常关键。"
    }
    },
    "Hardware Server": {
  "sysUpTime": {
    "name": "系统运行时间",
    "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
  },
  "ifAdminStatus": {
    "name": "接口管理状态",
    "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
  },
  "ifOperStatus": {
    "name": "接口操作状态",
    "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
  },
  "ifHighSpeed": {
    "name": "接口带宽",
    "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
  },
  "ifInErrors": {
    "name": "每秒接收错误数据包数",
    "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
  },
  "ifOutErrors": {
    "name": "每秒发送错误数据包数",
    "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
  },
  "ifInDiscards": {
    "name": "每秒接收丢包数",
    "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
  },
  "ifOutDiscards": {
    "name": "每秒发送丢包数",
    "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
  },
  "ifInUcastPkts": {
    "name": "每秒接收单播数据包数",
    "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
  },
  "ifOutUcastPkts": {
    "name": "每秒发送单播数据包数",
    "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
  },
  "ifInOctets": {
    "name": "接口每秒接收流量",
    "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
  },
  "ifOutOctets": {
    "name": "接口每秒发送流量",
    "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
  },
  "iftotalInOctets": {
    "name": "设备每秒接收总流量",
    "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
  },
  "iftotalOutOctets": {
    "name": "设备每秒发送总流量",
    "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
  },
   "ipmi_chassis_power_state": {
        "name": "电源状态",
        "desc": "电源状态指标，用于监测设备是否处于开机状态。其值可以表示电源开启或关闭状态。主要用于远程管理和监控设备的电源情况。"
    },
    "ipmi_power_watts": {
        "name": "功率",
        "desc": "功率指标以瓦特 (watts) 为单位，反映设备当前功耗。通过此指标可以评估设备能效和功耗趋势。便于设置节能政策和资源优化。"
    },
    "ipmi_voltage_volts": {
        "name": "电压功率",
        "desc": "电压功率指标以伏特 (volts) 为单位，监测设备内部不同电源轨的电压情况。稳定的电压供应对于设备的可靠性至关重要。通过该指标可以快速识别电气问题，保障正常运行。"
    },
    "ipmi_fan_speed_rpm": {
        "name": "风扇转速",
        "desc": "风扇转速指标以每分钟转数 (rpm) 表示，监测设备内风扇的工作状态。高效的风扇运作是维护设备温度的关键。有助于防止过热，确保设备长时间稳定运行。"
    },
    "ipmi_temperature_celsius": {
        "name": "温度",
        "desc": "温度指标以摄氏度 (Celsius) 为单位，监控设备内部温度。通过监测温度可以预防热量累积，防止设备过热。对于维持系统的稳定性和寿命非常关键。"
    }
    },
    "SNMP Trap": {        
    }
}

LANGUAGE_DICT = {
    "MONITOR_OBJECT_TYPE": MONITOR_OBJECT_TYPE,
    "MONITOR_OBJECT": MONITOR_OBJECT,
    "MONITOR_OBJECT_PLUGIN": MONITOR_OBJECT_PLUGIN,
    "MONITOR_OBJECT_METRIC_GROUP": MONITOR_OBJECT_METRIC_GROUP,
    "MONITOR_OBJECT_METRIC": MONITOR_OBJECT_METRIC,
}
