MONITOR_OBJECT_TYPE = {
    "OS": "操作系统",
    "Web": "网站",
    "K8S": "K8S",
    "Device": "设备",
    "System": "系统",
}

MONITOR_OBJECT = {
    "Host": "主机",
    "Website": "网站",
    "Cluster": "K8S集群",
    "Pod": "Pod",
    "Node": "Node",
    "Switch": "交换机",
    "Router": "路由器",
    "Loadbalance": "负载均衡",
    "Firewall": "防火墙",
    "Detection Device": "检测设备",
    "Bastion Host": "堡垒机",
    "Scanning Device": "扫描设备",
    "Audit System": "审计系统",
}

MONITOR_OBJECT_PLUGIN = {
    "Host General": {
        "name": "主机",
        "desc": "主机监控插件用于收集和分析主机的性能数据，包括CPU、内存、磁盘和网络使用情况"
    },
    "Host SNMP": {
        "name": "主机（SNMP）",
        "desc": "SNMP插件用于通过 SNMP 监控和管理主机的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Website General": {
        "name": "网站",
        "desc": "网站拨测插件的作用是可以定期检查HTTP/HTTPS连接的可用性和性能"
    },
    "K8S General": {
        "name": "K8S",
        "desc": "K8S监控插件用于监控Kubernetes集群的状态和健康，包括节点、容器和pod的性能指标"
    },
    "Switch SNMP General": {
        "name": "交换机通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理交换机的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Router SNMP General": {
        "name": "路由器通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理路由器的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Loadbalance SNMP General": {
        "name": "负载均衡通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理负载均衡的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Firewall SNMP General": {
        "name": "防火墙通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理防火墙的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Detection Device SNMP General": {
        "name": "检测设备通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理检测设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Bastion Host SNMP General": {
        "name": "堡垒机通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理堡垒机的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Scanning Device SNMP General": {
        "name": "扫描设备通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理扫描设备的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
    "Audit System SNMP General": {
        "name": "审计系统通用（SNMP）",
        "desc": "SNMP 通用插件用于通过 SNMP 监控和管理审计系统的监控情况。管理员可以获取有关设备的关键信息，例如 接口流量、错误统计和状态信息等，从而优化网络性能和提高管理效率。"
    },
}

MONITOR_OBJECT_METRIC_GROUP = {
    "Host": {
        "CPU": "CPU",
        "CPU Load": "负载",
        "DISK": "磁盘",
        "SWAP": "SWAP",
        "MEMORY": "内存",
        "Net": "网络",
        "UDP": "UDP",
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    },
    "Website": {
        "HTTP": "HTTP"
    },
    "Cluster": {
        "Counts": "计数",
        "Utilization": "使用率"
    },
    "Pod": {
        "Status": "状态",
        "CPU": "CPU",
        "Memory": "内存",
        "Disk": "磁盘",
        "Network": "网络"
    },
    "Node": {
        "Status": "状态",
        "CPU": "CPU",
        "Memory": "内存",
        "Disk": "磁盘",
        "Network": "网络",
        "Load": "负载"
    },
    "Switch": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    },
    "Router": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    },
    "Loadbalance": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    },
    "Firewall": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    },
    "Detection Device": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    },
    "Bastion Host": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    },
    "Scanning Device": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    },
    "Audit System": {
        "Base": "基础",
        "Status": "状态",
        "Bandwidth": "带宽",
        "Packet Error": "错包",
        "Packet Loss": "丢包",
        "Packet": "数据包",
        "Traffic": "流量"
    }
}

MONITOR_OBJECT_METRIC = {
    "Host": {
        "cpu_summary.usage": {
            "name": "CPU 使用率",
            "desc": "当前 CPU 的总使用率，表示 CPU 正在被使用的百分比。计算方式为用户态、系统态、硬中断等时间的总和除以总时间。"
        },
        "cpu_summary.idle": {
            "name": "CPU 空闲率",
            "desc": "当前 CPU 的空闲状态的百分比，表示 CPU 没有进行任何处理的时间。"
        },
        "cpu_summary.iowait": {
            "name": "等待 IO 的时间占比",
            "desc": "当前 CPU 等待 I/O 操作完成而处于空闲状态的时间比例。计算公式为等待 I/O 的时间占总时间的百分比。"
        },
        "cpu_summary.system": {
            "name": "系统占用率",
            "desc": "CPU 在内核态（系统程序）下的使用率，表示 CPU 处理系统任务的时间比例。"
        },
        "cpu_summary.user": {
            "name": "用户占用率",
            "desc": "CPU 在用户态下的使用率，表示 CPU 运行用户程序的时间比例。"
        },
        "load1": {
            "name": "1 分钟平均负载",
            "desc": "系统在过去 1 分钟内的平均负载，表现为同时运行的进程数和排队的进程数。"
        },
        "load5": {
            "name": "5 分钟平均负载",
            "desc": "系统在过去 5 分钟内的平均负载，反映整体系统性能和负载的变化趋势。"
        },
        "load15": {
            "name": "15 分钟平均负载",
            "desc": "系统在过去 15 分钟内的平均负载，提供对系统长期负载状态的概览。"
        },
        "io.w_s": {
            "name": "磁盘写速率",
            "desc": "磁盘每秒的写入次数，反映写入操作的频率和性能表现。"
        },
        "io.rkb_s": {
            "name": "磁盘读速率",
            "desc": "磁盘每秒的读取次数，反映读取操作的频率和性能表现。"
        },
        "disk.is_use": {
            "name": "磁盘使用率",
            "desc": "磁盘已使用空间占总空间的百分比，表明存储的使用程度。"
        },
        "disk.used": {
            "name": "磁盘已用空间大小",
            "desc": "当前磁盘已使用的空间大小，以字节为单位表示。"
        },
        "env.procs": {
            "name": "总进程数",
            "desc": "当前系统中运行的所有进程的数量，反映系统的并发处理能力。"
        },
        "env.proc_running_current": {
            "name": "正在运行进程数",
            "desc": "当前正在运行的进程数量，表示系统当前的负载情况。"
        },
        "env.procs_blocked_current": {
            "name": "正在等待 IO 的进程数",
            "desc": "当前正在等待 I/O 操作的进程数量，反映系统的 I/O 性能瓶颈。"
        },
        "mem.total": {
            "name": "物理内存总大小",
            "desc": "当前主机的物理内存总容量。"
        },
        "mem.free": {
            "name": "物理内存空闲量",
            "desc": "当前主机的空闲物理内存量。"
        },
        "mem.cached": {
            "name": "Cache 缓存的空间大小",
            "desc": "当前主机用于缓存的物理内存空间。"
        },
        "mem.buffer": {
            "name": "Buffer 的空间大小",
            "desc": "当前主机用于 Buffer 的物理内存空间。"
        },
        "mem.usable": {
            "name": "应用程序内存可用量",
            "desc": "当前主机的物理内存中可供应用程序使用的可用量。"
        },
        "mem.pct_usable": {
            "name": "应用程序内存可用率",
            "desc": "当前主机的物理内存中可供应用程序使用的内存百分比。"
        },
        "mem.used": {
            "name": "应用程序内存使用量",
            "desc": "当前主机用于应用程序的物理内存量。"
        },
        "mem.pct_used": {
            "name": "应用程序内存使用占比",
            "desc": "当前主机中物理内存被应用程序占用的百分比。"
        },
        "mem.psc_used": {
            "name": "物理内存已用量",
            "desc": "当前物理内存已被使用的大小。"
        },
        "mem.shared": {
            "name": "共享内存使用量",
            "desc": "当前主机中共享内存的使用大小。"
        },
        "swap.free": {
            "name": "SWAP 空闲量",
            "desc": "当前交换空间中空闲的大小。"
        },
        "swap.total": {
            "name": "SWAP 总量",
            "desc": "当前交换空间的总大小。"
        },
        "swap.used": {
            "name": "SWAP 已用量",
            "desc": "当前已被使用的交换空间大小。"
        },
        "swap.pct_used": {
            "name": "SWAP 使用率",
            "desc": "当前已用的交换空间占总交换空间的占比。"
        },
        "net.speed_packets_recv": {
            "name": "网卡入包量",
            "desc": "网卡每秒接收的网络数据包的数量。"
        },
        "net.speed_packets_sent": {
            "name": "网卡出包量",
            "desc": "网卡每秒发送的网络数据包的数量。"
        },
        "net.speed_recv": {
            "name": "网卡入流量",
            "desc": "网卡每秒接收到的字节数。"
        },
        "net.speed_sent": {
            "name": "网卡出流量",
            "desc": "网卡每秒发送的字节数。"
        },
        "net.errors": {
            "name": "网卡错误包",
            "desc": "网卡驱动程序检测到的发送或接收错误的总数。"
        },
        "net.dropped": {
            "name": "网卡丢弃包",
            "desc": "网卡驱动程序丢弃的数据包总数。"
        },
        "net.collisions": {
            "name": "网卡冲突包",
            "desc": "网卡上检测到的冲突总数。"
        },
        "netstat.cur_udp_indatagrams": {
            "name": "UDP 接收包量",
            "desc": "当前 UDP 网络接口接收到的包的数量。"
        },
        "netstat.cur_udp_outdatagrams": {
            "name": "UDP 发送包量",
            "desc": "当前 UDP 网络接口发送的包的数量。"
        },
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    },
    "Website": {
        "http_success.rate": {
            "name": "拨测状态",
            "desc": "该指标表示探测操作的成功状态。成功状态用1表示，而失败状态用0表示。监测此指标对确保系统的可用性至关重要，可以快速判断监控目标的健康状况。若该值为0，则需要进一步调查以确定失败原因。"
        },
        "http_total.duration": {
            "name": "HTTP响应时间",
            "desc": "该指标表示从发起HTTP请求到接收到HTTP响应的总时间。用于评估Web服务的性能，尤其是在处理用户请求时。较长的持续时间可能表示后端处理效率低或网络延迟，影响用户体验。对提高系统响应性和优化性能至关重要。"
        },
        "http_dns.lookup.time": {
            "name": "DNS解析时间",
            "desc": "该指标表示进行DNS解析所消耗的时间。DNS解析是将域名转换为IP地址的过程，较高的解析时间可能导致延迟并影响用户访问速度。监测此指标有助于识别潜在的DNS问题，可以优化系统的域名解析性能。"
        },
        "http_ssl": {
            "name": "启用 SSL/TLS",
            "desc": "该指标用于表示HTTP请求的SSL/TLS连接状态。值为1表示连接成功并且使用SSL/TLS加密，值为0则表示未使用加密或连接失败。这通常用于监测和确认Web服务是否通过SSL/TLS安全地提供服务。"
        },
        "http_status_code": {
            "name": "HTTP 响应状态码",
            "desc": "该指标用于表示HTTP请求的响应状态码。它记录了HTTP响应状态码的值，例如200（成功）、404（未找到）、500（服务器错误）等。这些状态码对于监控Web应用程序的健康状况和性能非常重要，可以帮助识别潜在问题。"
        },
        "http.redirects.count": {
            "name": "重定向次数",
            "desc": "该指标记录在处理HTTP请求过程中触发的重定向数量。频繁的重定向可能指示过于复杂的URL结构，可能导致用户等待长时间。监测此指标有助于识别不必要的重定向，从而优化URL结构，提高用户体验。"
        },
        "http_content.length.gauge": {
            "name": "HTTP内容长度",
            "desc": "该指标表示HTTP响应的内容长度，单位为字节。较大的内容长度可能导致数据传输时间过长，并消耗更多带宽。在优化网站性能或分析带宽使用时，监测此指标至关重要。了解响应内容大小可以帮助开发者进行优化。"
        }
    },
    "Cluster": {
        "cluster_pod_count": {
            "name": "Pod Count",
            "desc": "用于统计当前 Kubernetes 集群中 Pods 的总数。该指标会返回集群中运行的 Pod 的数量，包括所有命名空间中的 Pod。"
        },
        "cluster_node_count": {
            "name": "Node Count",
            "desc": "用于统计当前 Kubernetes 集群中节点的总数。该指标返回集群中可用节点的数量，帮助用户了解集群的规模和资源。"
        },
        "cluster_cpu_utilization": {
            "name": "CPU Utilization",
            "desc": "表示集群中 CPU 的当前利用率，通常以百分比形式表示。"
        },
        "cluster_memory_utilization": {
            "name": "Memory Utilization",
            "desc": "显示集群内存的当前利用率，以百分比形式展示。"
        }
    },
    "Pod": {
        "pod_status": {
            "name": "Pod状态",
            "desc": "获取 Pod 当前的状态信息，例如已运行、已停止等。"
        },
        "pod_restart_count": {
            "name": "重启次数",
            "desc": "监控 Pod 内各个容器的重启次数，以评估稳定性与问题频发程度。"
        },
        "pod_cpu_utilization": {
            "name": "CPU使用率",
            "desc": "计算 Pod CPU 使用率，即容器 CPU 限制与请求的差值，反映 CPU 资源的入住情况。"
        },
        "pod_memory_utilization": {
            "name": "内存使用率",
            "desc": "计算 Pod 的内存利用率，即内存限制与请求的比例。"
        },
        "pod_io_writes": {
            "name": "I/O写速率",
            "desc": "此指标表示特定Pod在指定时间段内的I/O写入操作次数。写入次数可以帮助分析应用程序对存储系统的写入需求。"
        },
        "pod_io_read": {
            "name": "I/O读速率",
            "desc": "此指标表示特定Pod在指定时间段内的I/O读取操作次数。读取次数可以帮助分析应用程序对存储系统的读取需求。"
        },
        "pod_network_in": {
            "name": "网络入流量",
            "desc": "监控 Pod 的网络流入流量，通过 Pod 的容器数量与 IP 数量计算而得。"
        },
        "pod_network_out": {
            "name": "网络出流量",
            "desc": "监控 Pod 的网络流出流量，通过 Pod 的容器数量与 IP 数量计算而得。"
        }
    },
    "Node": {
        "node_status_condition": {
            "name": "Node状态",
            "desc": "节点状态用于指示节点的当前运行状态，比如“运行中”或“已停止”。它有助于管理员监控和管理Kubernetes集群中的节点。"
        },
        "node_cpu_utilization": {
            "name": "CPU使用率",
            "desc": "CPU使用率表示当前节点CPU的实际使用水平，相对于其总可用CPU资源。监控此指标有助于识别CPU瓶颈和优化资源分配。"
        },
        "node_memory_usage": {
            "name": "应用内存使用量",
            "desc": "应用内存使用量表示在节点中运行的应用程序占用的内存总量。此指标有助于了解应用程序的内存需求及其对系统性能的影响。"
        },
        "node_memory_utilization": {
            "name": "应用内存使用率",
            "desc": "应用内存使用率是指应用程序已使用的内存量与其配置的内存限制之比。通过监控此指标，用户可以判断是否需要调整内存限制。"
        },
        "node_physical_memory_usage": {
            "name": "物理内存使用量",
            "desc": "物理内存使用量是指节点实际使用的物理内存总量。了解这一指标可帮助管理员发现是否需要扩展物理内存以支持更高负荷。"
        },
        "node_physical_memory_utilization": {
            "name": "物理内存使用率",
            "desc": "物理内存使用率表示节点已使用的物理内存占总可用物理内存的百分比。此指标有助于评估节点的内存压力和健康状态。"
        },
        "node_io_read": {
            "name": "磁盘写速率",
            "desc": "磁盘写速率表示节点在特定时间段内进行的写入操作的速率。此指标对于监控应用程序的磁盘写入性能至关重要。"
        },
        "node_io_write": {
            "name": "磁盘读速率",
            "desc": "磁盘读速率表示节点在特定时间段内进行的读取操作的速率。此指标有助于评估应用程序的数据读取性能和存储负载。"
        },
        "node_network_receive": {
            "name": "网卡入流量",
            "desc": "网卡入流量是指通过网络接口接收到的数据流量。监控此指标可帮助分析网络带宽是否足够以及网络性能情况。"
        },
        "node_network_transmit": {
            "name": "网卡出流量",
            "desc": "网卡出流量是指通过网络接口发送的数据流量。此指标有助于了解节点的网络出口需求和潜在的瓶颈。"
        },
        "node_cpu_load1": {
            "name": "1 分钟平均负载",
            "desc": "1 分钟平均负载表示过去1分钟内系统的平均负载情况。该指标有助于即时了解系统的负载水平。"
        },
        "node_cpu_load5": {
            "name": "5 分钟平均负载",
            "desc": "5 分钟平均负载表示过去5分钟内系统的平均负载情况。此指标有助于识别负载趋势及其对系统性能的影响。"
        },
        "node_cpu_load15": {
            "name": "15 分钟平均负载",
            "desc": "15 分钟平均负载表示过去15分钟内系统的平均负载情况。监控该指标可帮助管理员理解系统的长期负载状态。"
        }
    },
    "Switch": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    },
    "Router": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    },
    "Loadbalance": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    },
    "Firewall": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    },
    "Detection Device": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    },
    "Bastion Host": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    },
    "Scanning Device": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    },
    "Audit System": {
        "sysUpTime": {
            "name": "系统运行时间",
            "desc": "该指标表示设备自上次启动以来的运行时间，单位为天。通过监测设备的运行时间，网络管理员可以了解到设备的稳定性及可靠性，识别潜在的重启或故障问题。"
        },
        "ifAdminStatus": {
            "name": "接口管理状态",
            "desc": "此指标表示网络交换机接口的管理状态。它用于指示接口是否被管理人员启用（up）或禁用（down），以及其他状态如测试或已删除等。这个信息对网络管理和故障排查非常重要。"
        },
        "ifOperStatus": {
            "name": "接口操作状态",
            "desc": "此指标反映网络交换机接口的实际运行状态，表明接口是否正在工作。与管理状态不同，运行状态指示接口是否能够成功接收和发送流量。这对监测网络健康至关重要。"
        },
        "ifHighSpeed": {
            "name": "接口带宽",
            "desc": "该指标表示网络接口支持的最高数据传输速度，单位通常为KB每秒。了解接口的最高速度能够帮助管理员优化流量和利用网络资源。"
        },
        "ifInErrors": {
            "name": "每秒接收错误数据包数",
            "desc": "此指标计算过去5分钟内接收到的错误包的平均速率，单位为每秒。通过监测接收错误，管理员可以及时发现潜在的问题，例如物理连接故障或配置错误。"
        },
        "ifOutErrors": {
            "name": "每秒发送错误数据包数",
            "desc": "该指标计算过去5分钟内发送错误包的平均速率，单位为每秒。监测发送错误对于识别传输问题和确保数据完整性至关重要。"
        },
        "ifInDiscards": {
            "name": "每秒接收丢包数",
            "desc": "此指标表示过去5分钟内接收到的丢弃包的平均速率，单位为每秒。丢包可能表示网络堵塞或资源不足，监控此指标可以帮助管理员优化网络性能。"
        },
        "ifOutDiscards": {
            "name": "每秒发送丢包数",
            "desc": "本指标计算过去5分钟内发送的丢弃包的平均速率，单位为每秒。关注发送丢包情况能够帮助识别网络传输问题和配置不当的情况。"
        },
        "ifInUcastPkts": {
            "name": "每秒接收单播数据包数",
            "desc": "该指标表示过去5分钟内接收到的单播包的平均速率，单位为每秒。单播包的监测对于评估接口的使用情况及流量负载非常重要。"
        },
        "ifOutUcastPkts": {
            "name": "每秒发送单播数据包数",
            "desc": "此指标计算过去5分钟内发送的单播包的平均速率，单位为每秒。通过监测单播包的数量，管理员可以评估接口的传输性能以及流量的使用情况。"
        },
        "ifInBroadcastPkts": {
            "name": "每秒接收广播数据包数",
            "desc": "该指标表示过去5分钟内接收到的广播包的平均速率，单位为每秒。监测广播流量可以帮助管理员识别网络中的潜在瓶颈及网络效率问题。"
        },
        "ifOutBroadcastPkts": {
            "name": "每秒发送广播数据包数",
            "desc": "本指标计算过去5分钟内发送的广播包的平均速率，单位为每秒。了解广播流量对于控制网络流量和避免网络拥堵很重要。"
        },
        "ifInMulticastPkts": {
            "name": "每秒接收组播数据包数",
            "desc": "此指标表示过去5分钟内接收到的组播包的平均速率，单位为每秒。监测组播包对于特定应用程序（如多媒体传输）的性能评估至关重要。"
        },
        "ifOutMulticastPkts": {
            "name": "每秒发送组播数据包数",
            "desc": "该指标计算过去5分钟内发送的组播包的平均速率，单位为每秒。了解组播流量有助于管理员优化带宽使用及提高网络效率。"
        },
        "ifInOctets": {
            "name": "接口每秒接收流量",
            "desc": "此指标表示过去5分钟内接收到的字节数的平均速率，转换为兆字节（MB）单位。监测字节流量有助于评估接口的负载及带宽使用情况。"
        },
        "ifOutOctets": {
            "name": "接口每秒发送流量",
            "desc": "该指标计算过去5分钟内发送的字节数的平均速率，单位为兆字节（MB）。监测发送流量对于确保数据传输质量和优化网络性能非常重要。"
        },
        "iftotalInOctets": {
            "name": "设备每秒接收总流量",
            "desc": "此指标表示整个设备在过去5分钟内接收到的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的接收字节进行汇总计算，帮助管理员获取整个设备的接收流量情况，从而支持总体流量监控以及容量规划。"
        },
        "iftotalOutOctets": {
            "name": "设备每秒发送总流量",
            "desc": "此指标表示整个设备在过去5分钟内发送的总字节流量的平均速率，单位为兆字节每秒（MB/s）。通过对多个接口的发送字节进行汇总，管理员可以全面评估整个系统的发送性能，从而进行更有效的流量管理和优化。"
        }
    }
}

LANGUAGE_DICT = {
    "MONITOR_OBJECT_TYPE": MONITOR_OBJECT_TYPE,
    "MONITOR_OBJECT": MONITOR_OBJECT,
    "MONITOR_OBJECT_PLUGIN": MONITOR_OBJECT_PLUGIN,
    "MONITOR_OBJECT_METRIC_GROUP": MONITOR_OBJECT_METRIC_GROUP,
    "MONITOR_OBJECT_METRIC": MONITOR_OBJECT_METRIC,
}
